Repository: 1VOLK1/dpkg
Catalog: man/po4a/dpkg-deb.1/po/*.po
Languages: hu

source: dpkg suite
hu: dpkg készlet

source: NAME
hu: NÉV

source: dpkg-deb - Debian package archive (.deb) manipulation tool
hu: dpkg-deb - Debian csomag archívum (.deb) kezelõ eszköz

source: SYNOPSIS
hu: SZINOPSZIS

source: B<dpkg-deb> B<-b>|B<--build> I<directory> [I<archive>|I<directory>]
hu: B<dpkg-deb> B<-b>|B<--build> I<könyvtár> [I<archívum>|I<könyvtár>]

source: B<dpkg-deb> B<-I>|B<--info> I<archive> [I<control-file-name> ..]
hu: B<dpkg-deb> B<-I>|B<--info> I<archívum> [I<ellenõrzõ-fájl-név> ..]

source: B<dpkg-deb> B<-f>|B<--field> I<archive> [I<control-field-name> ...]
hu: B<dpkg-deb> B<-f>|B<--field> I<archívum> [I<ellenõrzõ-mezõ-név> ...]

source: B<dpkg-deb> B<-c>|B<--contents> I<archive>
hu: B<dpkg-deb> B<-c>|B<--contents> I<archívum>

source: B<dpkg-deb> B<-W>|B<--show> [B<--showformat>=I<format>] I<archive>
hu: B<dpkg-deb> B<-W>|B<--show> [B<--showformat>=I<formátum>] I<archívum>

source: B<dpkg-deb> B<-x>|B<--extract>|B<-X>|B<--vextract> I<archive directory>
hu: B<dpkg-deb> B<-x>|B<--extract>|B<-X>|B<--vextract> I<archívum könyvtár>

source: B<dpkg-deb> B<-e>|B<--control> I<archive directory>
hu: B<dpkg-deb> B<-e>|B<--control> I<archívum könyvtár>

source: B<dpkg-deb --fsys-tarfile> I<archive>
hu: B<dpkg-deb --fsys-tarfile> I<archívum>

source: DESCRIPTION
hu: LEÍRÁS

source: B<dpkg-deb> packs, unpacks and provides information about Debian archives.
hu: A B<dpkg-deb> Debian archívumokat csomagol, kibont és információkat nyújt róluk.

source: Use B<dpkg> to install and remove packages from your system.
hu: Csomagok telepítéséhez és eltávolításához a rendszerbõl a B<dpkg> programot kell használni.

source: You can also invoke B<dpkg-deb> by calling B<dpkg> with whatever options you want to pass to B<dpkg-deb>. B<dpkg> will spot that you wanted B<dpkg-deb> and run it for you.
hu: A B<dpkg-deb> a B<dpkg>-val is hívható minden lehetéséggel, melyet át akarsz adni a B<dpkg-deb>-nek. A B<dpkg> látja, hogy a B<dpkg-deb>-et akarod és el fogja indítani.

source: ACTION OPTIONS
hu: MÛVELETI LEHETÕSÉGEK

source: Creates a debian archive from the filesystem tree stored in I<directory>. I<directory> must have a B<DEBIAN> subdirectory, which contains the control information files such as the control file itself. This directory will I<not> appear in the binary package's filesystem archive, but instead the files in it will be put in the binary package's control information area.
hu: Létrehoz egy Debian archívumot a I<könyvtár>-ban lévõ fájlokból. A I<könyvtár> egy B<DEBIAN> alkönyvtár kell legyen, mely egyaránt tartalmazza az ellenõrzõ információs fájlokat és az ellenõrzõ fájlt magát. E könyvtár I<nem> jelenik meg a bináris csomag fájlrendszer archívumában, a benne lévõ fájlok a bináris csomag ellenõrzõ információs területére kerülnek.

source: You can specify the compression level used by adding a B<-z#> option. B<dpkg-deb> will pass that option on to gzip.
hu: A B<-z#> lehetõséggel megadható a tömörítási szint. A B<dpkg-deb> átadja ezt a gzip-nek..

source: Unless you specify B<--nocheck>, B<dpkg-deb> will read B<DEBIAN/control> and parse it. It will check it for syntax errors and other problems, and display the name of the binary package being built. B<dpkg-deb> will also check the permissions of the maintainer scripts and other files found in the B<DEBIAN> control information directory.
hu: A B<--nocheck> megadása nélkül, a B<dpkg-deb> elolvassa és értelmezi a B<DEBIAN/control> fájlt. Nyelvtani és más hibákat ellenõriz és kiírja a bináris csomag nevét. A B<dpkg-deb> ellenõrzi a karbantartói szkriptek jogait és a B<DEBIAN> ellenõrzõ információs könyvtárban lévõ más fájlokat.

source: If no I<archive> is specified then B<dpkg-deb> will write the package into the file I<directory>B<.deb>.
hu: Ha nincs I<archívum> megadva, a B<dpkg-deb> a csomagot a I<directory>B<.deb> fájlba készíti el.

source: If the archive to be created already exists it will be overwritten.
hu: A már létezõ hasonló archívumot felülírja.

source: If the second argument is a directory then B<dpkg-deb> will write to the file I<package>B<_>I<version>B<_>I<arch>B<.deb>, or I<package>B<_>I<version>B<.deb> if no B<Architecture> field is present in the package control file. When a target directory is specified, rather than a file, the B<--nocheck> option may not be used (since B<dpkg-deb> needs to read and parse the package control file to determine which filename to use).
hu: Ha a második argumentum egy könyvtár, a B<dpkg-deb> a I<csomag>B<_>I<verzió>B<_>I<architektúra>B<.deb>, vagy ha nincs B<Architektúra> mezõ a csomag ellenõrzõ fájlban, a I<csomag>B<_>I<verzió>B<.deb> fájlba ír. Ha nem fájl, hanem célkönyvtár van megadva, a B<--nocheck> lehetõség nem használható (mivel a B<dpkg-deb>-nek el kell olvasni a csomag ellenõrzõ fájlt a fájlnév meghatározásához).

source: Provides information about a binary package archive.
hu: Egy bináris csomagarchívumról ad információkat.

source: If no I<control-file-name>s are specified then it will print a summary of the contents of the package as well as its control file.
hu: Ha nincs megadva I<ellenõrzõ-fájl-név>, kiírja a csomag és ellenõrzõ fájlja tartalmát

source: If any I<control-file-name>s are specified then B<dpkg-deb> will print them in the order they were specified; if any of the components weren't present it will print an error message to stderr about each one and exit with status 2.
hu: Ha meg van adva I<ellenõrzõ-fájl-név>, a B<dpkg-deb> a megadott sorrendben mutat rájuk, és ha bármely összetevõ hiányzik, azokról hibaüzenetet küld a stderr-re és kilép 2-es kóddal.

source: Provides information about a binary package archive in the format specified by the B<--showformat> argument. The default format displays the package's name and version on one line, seperated by a tabulator.
hu: Egy bináris csomagarchívumról ad információkat a B<--showformat> argumentumban megadott formátumban. Az alap formátum kiírja a csomag nevét és verzióját 1 sorban tabulátorral elválasztva.

source: Extracts control file information from a binary package archive.
hu: Kiszedi az ellenõrzõ információs fájlt egy bináris csomagarchívumból

source: If no B<control-file-field>s are specified then it will print the whole control file.
hu: Ha nincsenek B<ellenõrzõ-fájl-mezõk>k megadva, kiírja az egész ellenõrzõ fájlt.

source: If any are specified then B<dpkg-deb> will print their contents, in the order in which they appear in the control file. If more than one B<control-file-field> is specified then B<dpkg-deb> will precede each with its field name (and a colon and space).
hu: Ha vannak, a B<dpkg-deb> kiírja tartalmukat az ellenõrzõ fájlban megadott sorrendben. Ha több, mint 1 B<ellenõrzõ-fájl-mezõ> került megadásra, a B<dpkg-deb> mezõnevükkel (és egy kettõsponttal és szóközzel) azonosítja õket.

source: No errors are reported for fields requested but not found.
hu: Nem ad hibajelet kért, de nem lelt mezõkre.

source: Lists the contents of the filesystem tree archive portion of the package archive. It is currently produced in the format generated by B<tar>'s verbose listing.
hu: Kilistázza a csomag archívum fájlrendszer fa archívum részét. Jelenleg a B<tar> részletes lista formátumban teszi meg ezt.

source: Extracts the filesystem tree from a package archive into the specified directory.
hu: Kibontja egy csomag archívum fájlrendszer fáját egy megadott könyvtárba.

source: B<--vextract> (B<-X>) prints a listing of the files extracted as it goes, while B<--extract> (B<-x>) is silent unless an error occurs.
hu: A B<--vextract> (B<-X>) kiírja a kibontásra került fájlokat, a B<--extract> (B<-x>) csak hibánál ír.

source: Note that extracting a package to the root directory will I<not> result in a correct installation! Use B<dpkg> to install packages.
hu: Egy csomag kibontása a gyökérkönyvtárba I<nem> ad helyes telepítést! A B<dpkg> vagy valamely felülete használható csomagok telepítésére.

source: I<directory> (but not its parents) will be created if necessary.
hu: Létrehozza a I<könyvtár>at (de szüleit nem), ha szükséges.

source: Extracts the filesystem tree data from a binary package and sends it to standard output in B<tar> format. Together with B<tar>(1) this can be used to extract a particular file from a package archive.
hu: Kibontja a fájlrendszer fa adatokat egy bináris csomagból és a szabvány kimenetre küldi B<tar> formátumban. A B<tar>(1)-ral együtt egyes fájlok kibontására használható egy csomag archívumból.

source: Extracts the control information files from a package archive into the specified directory.
hu: Kiszedi a csomag információs fájlokat egy csomag archívumból a megadott könyvtárba.

source: If no directory is specified then a subdirectory B<DEBIAN> in the current directory is used.
hu: Ha nincs megadva könyvtár a jelen könyvtár B<DEBIAN> alkönyvtárát fogja használni.

source: The target directory (but not its parents) will be created if necessary.
hu: Létrehozza a célkönyvtárat (de szüleit nem), ha szükséges.

source: Prints B<dpkg-deb>'s usage message, giving a summary of its options and their uses.
hu: Kiírja a B<dpkg-deb> használatát, megadva lehetõségei és azok használata összefoglalóját.

source: Prints B<dpkg-deb>'s version number.
hu: Kiírja a B<dpkg-deb> verziószámát.

source: Prints information about B<dpkg-deb>'s copyright licensing and lack of warranty. (The American spelling B<--license> is also supported).
hu: Kiírja a B<dpkg-deb> szerzõi jogi információit, a felhasználói engedélyt (licenc) és a garancia hiányát. (Az amerikai B<--license> helyesírás is támogatott.)

source: OTHER OPTIONS
hu: MÁS LEHETÕSÉGEK

source: This option is used to specify the format of the output B<--show> will produce. The format is a string that will be output for each package listed.
hu: E lehetõség adja meg a B<--show> kimentének formátumát. A formátum egy szöveg, melyet minden listázott csomag visszaad.

source: The string may reference any status field using the "${I<field-name>}" form, a list of the valid fields can be easily produced using B<-I> on the same package. A complete explanation of the formatting options (including escape sequences and field tabbing) can be found in the explanation of the B<--showformat> option in B<dpkg-query>(1).
hu: Ez az argumentum egy szöveg, mely a "${I<field-name>}" formát használó bármely állapotmezõre hivatkozhat, az érvényes mezõk listája könnyen elõállítható a B<-I>-lel ugyanazon csomagon. A formázási lehetõségek teljes magyarázata (ideértve az escape sorozatokat és mezõ oszlopokat) a B<dpkg-query>(1) B<--showformat> lehetõségének magyarázatában található.

source: The default for this field is "${Package}\et${Version}\en".
hu: E mezõ alapértelmezettje: "${Package}\et${Version}\en".

source: Ensures that B<dpkg-deb> builds a `new' format archive. This is the default.
hu: `Új' formátumú archívum használata. Ez az alap.

source: Forces B<dpkg-deb> to build an `old' format archive. This old archive format is less easily parsed by non-Debian tools and is now obsolete; its only use is when building packages to be parsed by versions of dpkg older than 0.93.76 (September 1995), which was released as i386 a.out only.
hu: A B<dpkg-deb>-et `régi' formátumú archívumra bírja. E régi archívum formátumot nehezebben értik nem-Debian eszközök és elavult; egyetlen használata olyan csomagok készítése, mely a 0.93.76-nál (1995 szeptember) régebbi verziójú dpkg számára is érthetõ, mely csak i386 a.out-ként volt kiadva.

source: Inhibits B<dpkg-deb --build>'s usual checks on the proposed contents of an archive. You can build any archive you want, no matter how broken, this way.
hu: Tiltja egy tervezett archívum tartalom szokásos B<dpkg-deb --build> ellenõrzését. Így bármilyen archívum készíthetõ, vagyis nem számít, milyen hibákat tartalmaz.

source: Enables debugging output. This is not very interesting.
hu: Hibajavító kimenet bekapcsolva. Nem túl érdekes.

source: BUGS
hu: HIBÁK

source: B<dpkg-deb -I> I<package1>B<.deb> I<package2>B<.deb> does the wrong thing.
hu: B<dpkg-deb -I> I<csomag1>B<.deb> I<csomag2>B<.deb> hibát okoz.

source: There is no authentication on B<.deb> files; in fact, there isn't even a straightforward checksum.
hu: Nincs hitelesítés a B<deb> fájlokhoz; illetve nincs ellenõrzõ összeg. (Ez megoldva - a fordító)

source: Do not attempt to use just B<dpkg-deb> to install software! You must use B<dpkg> proper to ensure that all the files are correctly placed and the package's scripts run and its status and contents recorded.
hu: A B<dpkg-deb> önmagában nem használható telepítésre! A B<dpkg> programot kell használni annak biztosításához, hogy minden fájl a helyére kerüljön, a csomagok szkriptjei lefussanak és állapotuk és tartalmuk rögzítésre kerüljön.

source: SEE ALSO
hu: LÁSD MÉG

source: AUTHOR
hu: SZERZÕ

source: B<dpkg-deb> and this manpage were written by Ian Jackson. They are Copyright (C) 1995-1996 by him and released under the GNU General Public Licence; there is NO WARRANTY. See I</usr/share/doc/dpkg/copyright> and I</usr/share/common-licenses/GPL> for details.
hu: A B<dpkg-deb> és e manoldal szerzõje Ian Jackson. Õ adta hozzá a Copyright (C)1995-1996 bejegyzést és adta ki GNU General Public Licence alatt; NINCS GARANCIA. Lásd a I</usr/share/doc/dpkg/copyright> és I</usr/share/common-licenses/GPL> fájlt a részletekért.
