Repository: 1VOLK1/dpkg
Catalog: man/*/deb-control.5.*.po
Languages: hu

source: January 2000
hu: 2000 január

source: dpkg utilities
hu: dpkg eszközök

source: NAME
hu: NÉV

source: deb-control - Debian packages' master control file format
hu: deb-control - Debian csomag fõ kontroll fájl formátum

source: SYNOPSIS
hu: SZINOPSZIS

source: control
hu: kontroll

source: DESCRIPTION
hu: LEÍRÁS

source: Each Debian package contains the master `control' file, which contains a number of fields. Each field begins with a tag, such as B<Package> or B<Version> (case insensitive), followed by a colon, and the body of the field. Fields are delimited only by field tags. In other words, field text may be multiple lines in length, but the installation tools will generally join lines when processing the body of the field (except in the case of the B<Description> field, see below).
hu: Minden Debian csomag tartalmaz egy `control' fájlt, mely mezõkbõl áll. Minden mezõ egy tag-gel kezdõdik, pl. B<Package> vagy B<Version>, melyet a mezõtörzs követ. A mezõket csak a mezõ tag-ek választják el. Vagyis, a mezõ szövege több sorból is állhat, de a telepítõ eszközök általában összefûzik ezeket egy mezõtörzs feldolgozásakor (kivéve a B<Description> mezõt, l. alább).

source: REQUIRED FIELDS
hu: KÖTELEZÕ MEZÕK

source: B<Package: >E<lt>package nameE<gt>
hu: B<Package: >E<lt>csomagnévE<gt>

source: The value of this field determines the package name, and is used to generate file names by most installation tools.
hu: E mezõ értéke adja meg a csomag nevét, melybõl a legtöbb telepítõ eszköz fájlneveket állít elõ.

source: B<Version: >E<lt>version stringE<gt>
hu: B<Version: >E<lt>verzióE<gt>

source: Typically, this is the original package's version number in whatever form the program's author uses. It may also include a Debian revision number (for non-native packages). If both version and revision are supplied, they are seperated by a hyphen, `-'. For this reason, the original version may not have a hyphen in its version number.
hu: Ez általában az eredeti csomag verzió szám, a program szerzõje által használt formában. Debian revízió számot is tartalmazhat (nem-natív csomagoknál). Ha mindkettõ meg van adva, elválasztásuk kötõjellel történik, `-'. Ezért az eredeti változat nem tartalmazhat kötõjelet verziószámában.

source: B<Maintainer: >E<lt>fullname emailE<gt>
hu: B<Maintainer: >E<lt>teljes.név emailE<gt>

source: Should be in the format `Joe Bloggs E<lt>jbloggs@foo.comE<gt>', and is typically the person who created the package, as opposed to the author of the software that was packaged.
hu: Formája ilyen lehet: `Joe Bloggs E<lt>jbloggs@foo.comE<gt>', és általában nem a szoftver szerzõjét hanem a csomag készítõjét tartalmazza.

source: B<Description: >E<lt>short descriptionE<gt>
hu: B<Description: >E<lt>rövid leírásE<gt>

source: B< >E<lt>long descriptionE<gt>
hu: B< >E<lt>hosszú leírásE<gt>

source: The format for the package description is a short brief summary on the first line (after the "Description" field). The following lines can be used as a longer, more detailed description. Each line of the long description must be preceded by a space, and blank lines in the long desription must contain a single '.' following the preceding space.
hu: A csomagleírás formátuma egy rövid összefoglaló az 1. sorban (a "Description" tag után). A következõ sorok hosszabb leírásra használhatók. A hosszú leírás minden sora szóközzel kell kezdõdjön, és a hosszú leírás üres sorai egy '.'-t kell tartalmazzanak a vezetõ szóköz után.

source: OPTIONAL FIELDS
hu: LEHETSÉGES MEZÕK

source: B<Section: >E<lt>sectionE<gt>
hu: B<Section: >E<lt>szakaszE<gt>

source: This is a general field that gives the package a category based on the software that it installs. Some common sections are `utils', `net', `mail', `text', `x11' etc.
hu: Ez egy általános mezõ, mely a csomagot egy témakörhöz (szakaszhoz) társítja, például ilyenekhez: `utils', `net', `mail', `text', `x11' stb.

source: B<Priority: >E<lt>priorityE<gt>
hu: B<Priority: >E<lt>elsõbbségE<gt>

source: Sets the importance of this package in relation to the system as a whole. Common priorities are `required', `standard', `optional', `extra' etc.
hu: Megadja e csomag fontosságát a rendszer egészében. Ilyenek például: `required', `standard', `optional', `extra' (kötelezõ, szokásos...) stb.

source: In Debian, the B<Section> and B<Priority> fields have a defined set of accepted values based on the Policy Manual. They are used to decide how the packages are layed out in the archive. A list of these can be obtained from the latest version of B<debian-policy> package.
hu: A Debianban a B<Section> és B<Priority> mezõk a Policy Manual-ban megadott értékeket vehetik fel. Ezek adják meg egy csomag elhelyezkedését az archívumban. Ezek megtekinthetõk a B<debian-policy> csomag legutóbbi verziójában.

source: This field is usually only needed when the answer is `yes'. It denotes a package that is required for proper operation of the system. Dpkg or any other installation tool will not allow an B<Essential> package to be removed (at least not without using one of the force options).
hu: E mezõ általában csak akkor kell, ha válasz `yes' (igen). Ez a csomagot a rendszer helyes mûködéséhez lényegesnek írja le. A dpkg vagy más telepítõ eszköz alapértelmezetten nem hajtja végre az B<Essential> (lényeges) csomagok eltávolítását (csak kényszerítõ lehetõségekkel).

source: The architecture specifies which type of hardware this package was compiled for. Common architectures are `i386', `m68k', `sparc', `alpha', `powerpc' etc. Note that the B<all> option is meant for packages that are architecture independent. Some examples of this are shell or Perl scripts, or documentation.
hu: Az architektúra megadja, hogy e csomag mely géptípusra fordított. A leggyakoriabbaktól indulva `i386', `amd64', `powerpc', `m68k', `sparc', `alpha', stb. Az B<all> lehetõség a gépfüggetlen csomagokat jelenti. Például ilyenek a Perl parancsfájlok, dokumentációk, stb.

source: B<Source: >E<lt>source nameE<gt>
hu: B<Source: >E<lt>forrás névE<gt>

source: The name of the source package that this binary package came from, if different than the name of the package itself.
hu: Annak a forrás csomagnak a neve, ahonnan e bináris is származik, ha eltér.

source: B<Depends: >E<lt>package listE<gt>
hu: B<Depends: >E<lt>csomaglistaE<gt>

source: List of packages that are required for this package to provide a non-trivial amount of functionality. The package maintenance software will not allow a package to be installed if the packages listed in its B<Depends> field aren't installed (at least not without using the force options), and will run the postinst scripts of packages listed in Depends: fields before those of the packages which depend on them, and run prerm scripts before.
hu: Azon csomagok listája, melyek szükségesek egy csomag rendes mûködéséhez. A csomagkarbantartó szoftver nem engedi a telepítést a B<Depends> mezõben megadott csomagok telepítése nélkül (csak kényszerítõ lehetõségekkel), és lefuttatja a postinst és prerm parancsfájlokat.

source: B<Pre-Depends: >E<lt>package listE<gt>
hu: B<Pre-Depends: >E<lt>csomaglistaE<gt>

source: List of packages that must be installed B<and> configured before this one can be installed. This is usually used in the case where this package requires another package for running its preinst script.
hu: Azon csomagok listája, melyek telepítése B<és> konfigurálása kötelezõ ennek telepítése elõtt. Általában akkor használatos, ha e csomag a telepítés elõtti (preinst) parancsfájl lefuttatásához egy másik csomagot igényel

source: B<Recommends: >E<lt>package listE<gt>
hu: B<Recommends: >E<lt>csomaglistaE<gt>

source: Lists packages that would be found together with this one in all but unusual installations. The package maintenance software will warn the user if they install a package without those listed in its B<Recommends> field.
hu: Azon csomagok listája, melyeket e csomaggal mindig együtt szokás használni, kivéve egyes, szokásostól eltérõ telepítéseket. A csomagkarbantartó szoftver figyelmezteti a felhasználót, ha a B<Recommends> mezõben lévõ csomagok kijelölése nélkül telepít.

source: B<Suggests:>\ E<lt>package\ listE<gt>
hu: B<Suggests:>\ E<lt>csomag\ listaE<gt>

source: Lists packages that are related to this one and can perhaps enhance its usefulness, but without which installing this package is perfectly reasonable.
hu: Azon csomagok listája, melyek ennek képességeit növelhetik, de melyek mellõzhetõk.

source: The syntax of B<Depends ,> B<Pre-Depends ,> B<Recommends> and B<Suggests> fields is a list of groups of alternative packages. Each group is a list of packages separated by vertical bar (or `pipe') symbols, `|'. The groups are separated by commas. Commas are to be read as `AND', and pipes as `OR', with pipes binding more tightly. Each item is a package name optionally followed by a version number specification in parentheses.
hu: A B<Depends ,> B<Pre-Depends ,> B<Recommends> és B<Suggests> mezõk szintaxisa más csomagok csoportjainak listája. Minden csoport egy függõleges vonalakkal (ún. `pipa', `|' jelekkel) elválasztott csomaglista. A csoportok vesszõkkel vannak elválasztva. A vesszõ `ÉS'-t, a pipa `VAGY'-ot jelent, akár nagyobb kötésekkel. Minden elem egy csomagnév, melyet a verziószám megadása követhet zárójelben.

source: A version number may start with a `E<gt>E<gt>', in which case any later version will match, and may specify or omit the Debian packaging revision (separated by a hyphen). Accepted version relationships are "E<gt>E<gt>" for greater than, "E<lt>E<lt>" for less than, "E<gt>=" for greater than or equal to, "E<lt>=" for less than or equal to, and "=" for equal to.
hu: A verziószám kezdõdhet így: `E<gt>E<gt>', ekkor bármely késõbbi verzió megfelel, és megadhat Debian csomag revíziót (kötõjellel elválasztva). Elfogadott verzióviszonyok: "E<gt>E<gt>" nagyobb mint, "E<lt>E<lt>" kisebb mint, "E<gt>=" nagyobb vagy egyenlõ, "E<lt>=" kisebb vagy egyenlõ, és "=" egyenlõ.

source: B<Conflicts: >E<lt>package listE<gt>
hu: B<Conflicts: >E<lt>csomaglistaE<gt>

source: Lists packages that conflict with this one, for example by containing files with the same names. The package maintenance software will not allow conflicting packages to be installed at the same time. Two conflicting packages should each include a B<Conflicts> line mentioning the other.
hu: Ütközõ csomagok, például azonos nevû fájlokat tartalmazók. A csomagkarbantartó szoftver nem engedi ezek egyidejû telepítését. 2 ütközõ csomag 1-1 B<Conflicts> mezõben hivatkozik egymásra.

source: B<Replaces: >E<lt>package listE<gt>
hu: B<Replaces: >E<lt>csomaglistaE<gt>

source: List of packages files from which this one replaces. This is used for allowing this package to overwrite the files of another package and is usually used with the B<Conflicts> field to force removal of the other package, if this one also has the same files as the conflicted package.
hu: Az e csomag által lecserélt csomag fájlok listája. Ez lehetõvé teszi e csomagnak más csomag fájljainak felülírását és általában a <Conflicts> mezõvel használatos a másik csomag törlésére, ha ez azonos nevû fájlt tartalmaz, mint az ütközõ csomag.

source: B<Provides:>\ E<lt>package\ listE<gt>
hu: B<Provides:>\ E<lt>csomag\ listaE<gt>

source: This is a list of virtual packages that this one provides. Usually this is used in the case of several packages all providing the same service. For example, sendmail and exim can serve as a mail server, so they provide a common package (`mail-transport-agent') on which other packages can depend. This will allow sendmail or exim to serve as a valid option to satisy the dependency. This prevents the packages that depend on a mail server from having to know the package names for all of them, and using `|' to separate the list.
hu: Ez egy e csomag által adott virtuális csomaglista. Általában eltérõ csomagok által nyújtott hasonló szolgáltatás esetén használt. Például a sendmail és exim levelezõkiszolgálók, így egy általános csomagot adnak (`mail-transport-agent'), meytõl más csomagok függhetnek. Így a sendmail vagy exim érvényes függõségként szolgálhat. Így a csomagoknak nem kell ismerniük az összes levelezõkiszolgálót egy `|'-kkal elválasztott listában.

source: The syntax of B<Conflicts ,> B<Replaces> and B<Provides> is a list of package names, separated by commas (and optional whitespace). In the B<Conflicts> field, the comma should be read as `OR'. An optional version can also be given with the same syntax as above for the B<Conflicts> and B<Replaces> fields.
hu: A B<Conflicts ,> B<Replaces> és B<Provides> szintaxisa egy vesszõkkel (és tetszõleges helykitöltõkkel) elválasztott csomagnév lista. A B<Conflicts> mezõben, a vesszõ `VAGY'. A verzió szintén megadható a már ismert módon.

source: EXAMPLE
hu: PÉLDA

source: SEE ALSO
hu: LÁSD MÉG
