Repository: 1VOLK1/dpkg
Catalog: man/*/dpkg-divert.8.*.po
Languages: fr

source: December 1999
fr: décembre 1999

source: Debian Project
fr: Projet Debian

source: dpkg utilities
fr: Utilitaires de dpkg

source: NAME
fr: NOM

source: dpkg-divert - override a package's version of a file
fr: dpkg-divert - remplacer la version d'un fichier contenu dans un paquet.

source: B<dpkg-divert> [options] [--add] I<E<lt>fileE<gt>>
fr: B<dpkg-divert> [options] [--add] I<E<lt>fichierE<gt>>

source: B<dpkg-divert> [options] --remove I<E<lt>fileE<gt>>
fr: B<dpkg-divert> [options] --remove I<E<lt>fichierE<gt>>

source: B<dpkg-divert> [options] --list I<E<lt>glob-patternE<gt>>
fr: B<dpkg-divert> [options] --list I<E<lt>motif-de-rechercheE<gt>>

source: B<dpkg-divert> [options] --truename I<E<lt>fileE<gt>>
fr: B<dpkg-divert> [options] --truename I<E<lt>fichierE<gt>>

source: File `diversions' are a way of forcing dpkg not to install a file into its location, but to a `diverted' location. Diversions can be used through the Debian package scripts to move a file away when it causes a conflict. System administrators can also use it to override some package's configuration file, or whenever some files (which aren't marked as 'conffiles') need to be preserved by dpkg, when installing a newer version of a package which contains those files.
fr: Le «\ détournement\ » de fichier est un moyen d'obliger dpkg à installer un fichier non pas dans l'emplacement prévu mais dans un autre. Les scripts des paquets Debian se servent de la déviation pour déplacer les fichiers qui créent des conflits. Les administrateurs s'en servent, lors de l'installation d'une version plus récente d'un paquet, pour remplacer les fichiers de configuration de certains paquets, ou bien à chaque fois que des fichiers (qui ne sont pas des «\ conffiles\ ») doivent être préservés par Dpkg.

source: B<dpkg-divert> is the utility used to set up and update the list of diversions. It functions in three basic modes - adding, removing, and listing diversions. The options are --add, --remove, and --list, respectively. Additionally, it can print out the real name for a diverted file with --truename. Other options (listed below) may also be specified.
fr: B<dpkg-divert> sert à créer et à mettre à jour la liste des détournements. Il possède trois modes élémentaires - l'ajout, la suppression et le listage d'un détournement. Les options sont respectivement --add, --remove, et --list. De plus, il peut afficher le vrai nom d'un fichier détourné avec --truename. On peut indiquer d'autres options (voyez la liste ci-dessous).

source: I<--admindir E<lt>directoryE<gt>>
fr: I<--admindir E<lt>répertoireE<gt>>

source: Set the dpkg data directory to E<lt>directoryE<gt> (default: /var/lib/dpkg).
fr: Définit le répertoire de données de Dpkg comme E<lt>répertoireE<gt> (par défaut c'est /var/lib/dpkg).

source: I<--divert E<lt>divert-toE<gt>>
fr: I<--divert E<lt>détourner-dansE<gt>>

source: E<lt>divert-toE<gt> is the name used by other packages' versions.
fr: E<lt>détourner-dansE<gt> est le nom utilisé pour les autres versions des paquets.

source: Output the version and the short usage instructions, and exit successfully.
fr: Affiche la version, quelques instructions d'aide, et se termine normalement.

source: Specifies that all packages' versions are diverted.
fr: Indique que toutes les versions des paquets sont détournées.

source: I<--package E<lt>packageE<gt>>
fr: I<--package E<lt>paquetE<gt>>

source: E<lt>packageE<gt> is the name of a package whose copy of E<lt>fileE<gt> will not be diverted.
fr: E<lt>paquetE<gt> est le nom du paquet dont la copie de E<lt>fichierE<gt> ne sera pas détournée.

source: Quiet mode, i.e. no verbose output.
fr: Mode silencieux, pas de bavardage.

source: Actually move the file aside (or back). dpkg-divert will abort operation in case the destination file already exists.
fr: Met en fait le fichier de côté. Quand le fichier de destination existe, dpkg-divert interrompt l'opération.

source: Test mode, i.e. don't actually perform any changes, just demonstrate.
fr: Mode de test, ne rien modifier réellement, seulement montrer.

source: Output program name and version and exit successfully.
fr: Affiche le nom du programme et sa version puis se termine normalement.

source: When adding, default is --local and --divert E<lt>originalE<gt>.distrib. When removing, --package or --local and --divert must match if specified.
fr: Pour l'ajout, le défaut est --local et --divert E<lt>originalE<gt>.distrib. Pour la suppression, --package ou --local et --divert doivent correspondre quand ils sont précisés.

source: Directories can't be diverted with dpkg-divert.
fr: On ne peut pas détourner des répertoires avec dpkg-divert.

source: Care should be taken when diverting shared libraries, ldconfig (8) creates a symbolic link based on the DT_SONAME field embedded in the library. Because ldconfig doesn't honour diverts (only dpkg does), if a diverted library has the same SONAME as the undiverted one the symlink may end up pointing at the diverted library.
fr: Il faut faire attention quand une bibliothèque partagée est détournée. ldconfig(8) crée un lien symbolique à partir du champ DT_SONAME embarqué dans la bibliothèque. ldconfig ne connaît pas les détournements (seul dpkg le fait), et si une bibliothèque détournée possède le même SONAME que la bibliothèque non détournée, le lien symbolique peut pointer en fin de compte sur la bibliothèque détournée.

source: EXAMPLES
fr: EXEMPLES

source: To divert all copies of a I</usr/bin/example.foo> to I</usr/bin/example>, performing the rename if required:
fr: Pour détourner toutes les copies de I</usr/bin/example.foo> vers I</usr/bin/example>, il faut modifier le nom si c'est demandé\ :

source: To remove that diversion:
fr: Pour supprimer ce détournement\ :

source: To divert any package trying to install I</usr/bin/example> to I</usr/bin/example.foo>, except your own I<wibble> package:
fr: Pour détourner un paquet qui veut installer I</usr/bin/example> dans I</usr/bin/example.foo>, sauf votre propre paquet I<wibble>\ :

source: FILES
fr: FICHIERS

source: File which contains the current list of diversions of the system. It is located in the dpkg administration directory, along with other files important to dpkg, such as `status' or `available'.
fr: Ce fichier contient la liste des détournements en oeuvre sur le système. Il se trouve dans le répertoire d'administration de dpkg, avec d'autres fichiers importants comme «\ status\ » ou «\ available\ ».

source: Note: dpkg-divert preserves the old copy of this file, with extension "-old", before replacing it with the new one.
fr: Note : dpkg-divert préserve l'ancienne copie de ce fichier, avec l'extension «\ -old\ », avant de la remplacer par la nouvelle.

source: SEE ALSO
fr: VOIR AUSSI

source: AUTHOR
fr: AUTEUR

source: This is free software; see the GNU General Public Licence version 2 or later for copying conditions. There is NO warranty.
fr: Ce programme est un logiciel libre ; voyez la « GNU General Public Licence » version 2 ou supérieure pour le copyright. Il n'y a PAS de garantie.
