Repository: 1VOLK1/dpkg
Catalog: man/*/dpkg-query.1.*.po
Languages: fr

source: Debian Project
fr: Projet Debian

source: dpkg suite
fr: suite dpkg

source: NAME
fr: NOM

source: dpkg-query - a tool to query the dpkg database
fr: dpkg-query - Un outil pour interroger la base de données de dpkg

source: B<dpkg-query> B<-l>|B<--list> I<package-name-pattern> ...
fr: B<dpkg-query> B<-l>|B<--list> I<nom-paquet-motif> ...

source: B<dpkg-query> B<-W>|B<--show> I<package-name-pattern> ...
fr: B<dpkg-query> B<-W>|B<--show> I<nom-paquet-motif> ...

source: B<dpkg-query> B<-s>|B<--status> I<package-name> ...
fr: B<dpkg-query> B<-s>|B<--status> I<nom-paquet> ...

source: B<dpkg-query> B<-L>|B<--listfiles> I<package-name> ...
fr: B<dpkg-query> B<-L>|B<--listfiles> I<nom-paquet> ...

source: B<dpkg-query> B<-S>|B<--search> I<filename-search-pattern> ...
fr: B<dpkg-query> B<-S>|B<--search> I<motif-de-recherche> ...

source: B<dpkg-query> B<-p>|B<--print-avail> I<package-name> ...
fr: B<dpkg-query> B<-p>|B<--print-avail> I<nom-paquet> ...

source: B<dpkg-query> is a tool to show information about packages listed in the B<dpkg> database.
fr: B<dpkg-query> est un outil pour afficher des informations sur les paquets connus par la base de données de B<dpkg>.

source: COMMANDS
fr: COMMANDES

source: B<-l> | B<--list> I<package-name-pattern> ...
fr: B<-l> | B<--list> I<nom-paquet-motif> ...

source: List packages matching given pattern. If no I<package-name-pattern> is given, list all packages in I</var/lib/dpkg/status>. Normal shell wildchars are allowed in I<package-name-pattern>. Please note you will probably have to quote I<package-name-pattern> to prevent the shell from performing filename expansion. For example this will list all package names starting with ``libc6'':
fr: Liste les paquets correspondants au motif donné. Quand on ne donne aucun I<nom-paquet-motif>, tous les paquets listés dans I</var/lib/dpkg/status> sont affichés. Les métacaractères ordinaires de l'interpréteur de commandes sont autorisés dans I<nom-paquet-motif>. Il faudra sans doute mettre I<nom-paquet-motif> entre apostrophes pour éviter l'expansion des noms de fichier par l'interpréteur de commandes. Par exemple, tous les paquets dont le nom commence par «\ libc6\ » seront affichés par la commande\ :

source: The output format of this option is not configurable, but varies automatically to fit the terminal width. It is intended for human readers, and is not easily machine-readable. See B<-W> (B<--show>) and B<--showformat> for a way to configure the output format.
fr: On ne peut pas configurer le format de sortie de cette option. Il s'adapte automatiquement à la largeur du terminal. Ce format est destiné aux humains et la machine le lit mal. Voyez B<-W> (B<--show>) et B<--showformat> pour une possible configuration de ce format.

source: B<-W> | B<--show> I<package-name-pattern> ...
fr: B<-W> | B<--show> I<nom-paquet-motif>...

source: Just like the B<--list> option this will list all packages matching the given pattern. However the output can be customized using the B<--showformat> option. The default output format gives one line per matching package, each line having the name and installed version of the package, separated by a tab.
fr: Tout comme l'option B<--list>, cette option affiche la liste des paquets qui correspondent au motif donné. La sortie peut cependant être formatée en utilisant l'option B<--showformat>. Le format de sortie par défaut est le suivant\ : une ligne pour chaque paquet, avec le nom et la version installée, séparé par une tabulation.

source: B<-s> | B<--status> I<package-name> ...
fr: B<-s> | B<--status> I<nom-paquet> ...

source: Report status of specified package. This just displays the entry in the installed package status database.
fr: Donne l'état du paquet indiqué. C'est simplement l'affichage de l'entrée de la base de données concernant les états des paquets installés.

source: B<-L> | B<--listfiles> I<package-name> ...
fr: B<-L> | B<--listfiles> I<paquet> ...

source: List files installed to your system from B<package-name>. However, note that files created by package-specific installation-scripts are not listed.
fr: Affiche la liste des fichiers de I<paquet> installés sur le système. Il faut remarquer cependant que les fichiers créés par les scripts d'installation particuliers au paquet ne sont pas affichés.

source: B<-S> | B<--search> I<filename-search-pattern> ...
fr: B<-S> | B<--search> I<motif-de-recherche> ...

source: Search for a filename from installed packages. All standard shell wildchars can be used in the pattern. This command will not list extra files created by maintainer scripts, nor will it list alternatives.
fr: Recherche un nom de fichier dans les paquets installés. On peut utiliser dans le motif tous les métacaractères de l'interpréteur de commandes. Cette commande ne donne pas les fichiers supplémentaires créés par les scripts du responsable de paquet, ni les alternatives.

source: B<-p> |B<--print-avail> I<package-name>
fr: B<-p> |B<--print-avail> I<paquet>

source: Display details about I<package-name>, as found in I</var/lib/dpkg/available>.
fr: Affiche des renseignements détaillés sur I<paquet>, tels qu'ils sont trouvés dans le fichier I</var/lib/dpkg/available>.

source: Display licence and copyright information.
fr: Affiche des renseignements sur la licence et le copyright.

source: Display version information.
fr: Affiche des renseignements sur la version.

source: Change the location of the B<dpkg> database. The default location is I</var/lib/dpkg>.
fr: Change l'endroit où se trouve la base de données de B<dpkg>. Par défaut, c'est I</var/lib/dpkg>.

source: This option is used to specify the format of the output B<--show> will produce. The format is a string that will be output for each package listed.
fr: Cette option sert à spécifier le format de sortie de l'option B<--show>. Ce format est une chaîne pour chaque paquet listé.

source: In the format string, \(lqB<\e>\(rq introduces escapes:
fr: Dans la chaîne, \(lqB<\e>\(rq déspécifie le caractère

source: B<\en> newline B<\er> carriage return B<\et> tab
fr: B<\en> nouvelle ligne B<\er> retour chariot B<\et> tabulation

source: \(lqB<\e>\(rq before any other character suppresses any special meaning of the following character, which is useful for \(lqB<\e>\(rq and \(lqB<$>\(rq.
fr: \(lqB<\e>\(rq avant un caractère supprime la signification du caractère qui suit. C'est utile pour les caractères \(lqB<\e>\(rq and \(lqB<$>\(rq.

source: Package information can be included by inserting variable references to package fields using the syntax \(lqB<${>I<field>[B<;>I<width>]B<}>\(rq. Fields are printed right-aligned unless the width is negative in which case left alignment will be used. The following I<field>s are recognised:
fr: On peut indiquer un paquet en insérant des appels de variables spécifiant des champs du paquet avec la syntaxe suivante\ : \(lqB<${>I<field>[B<;>I<width>]B<}>\(rq. Les champs sont alignés à droite, à moins que la largeur ne soit négative, auquel cas ils sont alignés à gauche. Les champs suivants sont reconnus\ :

source: The default format string is \(lqB<${Package}\et${Version}\en>\(rq. To get the name of the dpkg maintainer and the installed version, you could run:
fr: Le format par défaut est le suivant\ : \(lqB<${Paquet}\et${Version}\en>\(rq. Pour obtenir le nom du responsable de dpkg et la version installée, exécutez par exemple :

source: ENVIRONMENT
fr: ENVIRONNEMENT

source: This setting influences the output of the B<--list> option by changing the width of its output.
fr: Fixer le nombre de colonnes influence la sortie de l'option B<--list> en modifiant la largeur d'affichage.

source: AUTHOR
fr: AUTEUR

source: This is free software; see the GNU General Public Licence version 2 or later for copying conditions. There is NO warranty.
fr: Ce programme est un logiciel libre ; voyez la licence publique générale du projet GNU version 2 ou supérieure pour les droits de copie. Il n'y a PAS de garantie.

source: SEE ALSO
fr: VOIR AUSSI
